content-org/ai.org
#+TITLE: Deep Learning
#+date: 2023-02-27
#+author: Himanish

#+hugo_section: notes
#+hugo_categories: cs
#+hugo_menu: :menu "main" :weight 2001

#+startup: content

#+hugo_base_dir: ../
#+hugo_section: ./

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+hugo_custom_front_matter: :mathjax t

Develop intelligent systems via
1. Search Algorithms
2. Probabilistic Reasoning
3. Statistical Decision Theory

* Solving Problems by Searching
* Search in Complex Environments
- If the agent has no additional information—that is, if the environment is unknown—then the agent can do no better than to execute one of the actions at random.
- If the model is correct, then once the agent has found a solution, it can close its eyes because the solution is guaranteed to lead to the goal. Control theorists call this an open-loop system: ignoring the percepts breaks the loop between agent and environment. If there is a chance that the model is incorrect, or the environment is nondeterministic, then the agent would be safer using a closed-loop approach that monitors the percepts
